[
    {
        "title": "Portfolio Site",
        "tech": "React.js, HTML, CSS, Github",
        "description": "The site you're currently on! This is my longest running project and I'm incredibly proud of how it has turned out and improved from where it started. I'm constantly changing styles and updating content as I learn more. As soon as I start to feel comfortable with where this site is, I get a new idea to run with, so it's always changing. Hosted on Github Pages.",
        "link": "https://conner-huf.github.io/portfolio-site/"
    },
    {
        "title": "Noodle",
        "tech": "React.js, Python, Flask, Github, Heroku, APIs",
        "description": "A full-stack application for finding concerts in your local area. This is my largest scale project, and I'm hoping to link this with an affiliate code with ticketmaster if I can get approved at some point! I'm really proud of how this has turned out, and I continually improve it as I think of ideas. Uses Python Flask, React.js, Leaflet, TicketmasterAPI, SpotifyAPI, Heroku.",
        "link": "https://conner-huf.github.io/noodle/"
    },
    {
        "title": "Teeny Link",
        "tech": "React.js, HTML, CSS, Github, Heroku, Python, Flask, Firebase",
        "description": "An application that can shorten a url. Uses Firebase to store target long URLs and generated short URLs. Made using React, Python Flask, Firebase, Heroku. This was a fun project that I mainly wanted to make so that I could create more consistent looking links to all of my things, and I wanted to learn more about how to use firebase. I have since limited the database access to read only to ensure that I'm not charged, so unfortunately links can no longer be created. But the links created in the first month still work.",
        "link": "https://www.teeny-link.com/app"
    },
    {
        "title": "Pokedex Application",
        "tech": "React.js, Node.js, HTML, CSS, Github, APIs",
        "description": "An application that fetches data from the PokeApi to display information on the Pokemon game series. Made using React, PokeApi.co, and Node.js. This web app chugs through a lot of information to display the data, so it was a fun challenge to make it as efficient as possible.",
        "link": "https://conner-huf.github.io/pokedex/"
    },
    {
        "title": "Asteroids Game",
        "tech": "Unity, C#",
        "description": "A game inspired by the asteroids arcade game. Built using Unity. I really enjoy working with Unity, and I think this was a great way to get more acquainted with it. In my free time I like to play around with Unity and see what I can make, but this is the only complete project that I currently have available.",
        "link": "https://itzlumpz.itch.io/asteroids"
    },
    {
        "title": "Evermana WoW Addon",
        "tech": "Lua, APIs, Scripts",
        "description": "An addon I created for the popular MMO World of Warcraft. Displays the current mana points of the player in circumstances when it is not visible by default. I really like this project because I think it demonstrates a good approach to software solutions. I had an issue with the UI on WoW, I researched how I could fix it, and not only did I want to fix it, I acted on it.",
        "link": "https://github.com/conner-huf/EverMana"
    },
    {
        "title": "Spotify Clone",
        "tech": "React.js, Node.js, HTML, TailwindCSS, Github, Supabase",
        "description": "A study into recreating the Spotify web application's design and functionality. Made using React.js, Node.js, TailwindCSS, Github, and Supabase.",
        "link": "https://spotify-clone-sable-three.vercel.app/"
    },
    {
        "title": "Restaurant Site",
        "tech": "React.js, HTML, CSS, Github",
        "description": "A demo site for a restaurant to display their menu, about page, and contact information. Made using React.js, HTML, and CSS. Hosted on Github Pages.",
        "link": "https://conner-huf.github.io/restaurant-site/"
    }
]